Tekla Open API Reference for Tekla Structures 2025
PolygonNode Properties
The PolygonNode type exposes the following members.
Properties
Name | Description
Contour
 Gets or sets the contour points of flat geometry.
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
Top
See Also
Reference
PolygonNode Class
Tekla.Structures.Model Namespace